In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [4]:
df.loc[1:1]['FlightNumber'] = 10045.0+10

<ipython-input-4-b9b8ec0d35d3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[1:1]['FlightNumber'] = 10045.0+10

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [6]:
df.loc[3:3]['FlightNumber'] = 10065.0+10

<ipython-input-6-76818894e729>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[3:3]['FlightNumber'] = 10065.0+10

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [8]:
from_lst = []
to_lst = []
for i in df['From_To']:
    j = i.split('_')
    print(j)
    from_lst.append(j[0])
    to_lst.append(j[1])
df1 = pd.DataFrame({'From':from_lst,'To':to_lst})

['LoNDon', 'paris']
['MAdrid', 'miLAN']
['londON', 'StockhOlm']
['Budapest', 'PaRis']
['Brussels', 'londOn']

In [9]:
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# 3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [10]:
cap_lst =[]
cap_to = []
zip_obj = zip(df1.iloc[0:5]['From'], df1.iloc[0:5]['To'])
for i,j in zip_obj:
    cap_lst.append(i.title())
    cap_to.append(j.title())
df1['From'] = cap_lst
df1['To'] = cap_to

In [11]:
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# 4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [12]:
df.drop(['From_To'],axis=1,inplace=True)

In [13]:
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [14]:
pd.concat([df,df1],axis=1)

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

# In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [15]:
delay = pd.DataFrame()

In [16]:
delay['delay1'] = [df['RecentDelays'][0][0],'NAN',df['RecentDelays'][2][0],df['RecentDelays'][3][0],df['RecentDelays'][4][0]]

In [17]:
delay['delay2'] = [df['RecentDelays'][0][1],'NAN',df['RecentDelays'][2][1],'NAN',df['RecentDelays'][4][1]]

In [18]:
delay['delay3'] = ['NAN','NAN',df['RecentDelays'][2][2],'NAN','NAN']

In [19]:
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [20]:
delay

  delay1 delay2 delay3
0     23     47    NAN
1    NAN    NAN    NAN
2     24     43     87
3     13    NAN    NAN
4     67     32    NAN

In [26]:
df2 = pd.concat([df,delay],axis=1)

In [28]:
df2.drop(['RecentDelays'],axis =1)

   FlightNumber              Airline delay1 delay2 delay3
0       10045.0               KLM(!)     23     47    NAN
1       10055.0    <Air France> (12)    NAN    NAN    NAN
2       10065.0  (British Airways. )     24     43     87
3       10075.0       12. Air France     13    NAN    NAN
4       10085.0          "Swiss Air"     67     32    NAN